
### Terraform Plan
dbhds-entss-blue-us-east-1
<details><summary>Show plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.waf_log_group will be created
  + resource "aws_cloudwatch_log_group" "waf_log_group" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "aws-waf-logs-DBHDSAgencyIngressWAF-sandbox"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "agency"  = "dbhds"
          + "project" = "aws-waf-sandbox"
        }
      + tags_all                    = {
          + "agency"  = "dbhds"
          + "project" = "aws-waf-sandbox"
        }
    }

  # aws_wafv2_web_acl.web_acl will be created
  + resource "aws_wafv2_web_acl" "web_acl" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "Sandbox WAF for DBHDS ALB"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "DBHDSAgencyIngressWAF-sandbox"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + rule_json                   = jsonencode([])
      + scope                       = "REGIONAL"
      + tags                        = {
          + "agency"       = "dbhds"
          + "environment"  = "dev"
          + "owner"        = "Sydon"
          + "project-name" = "aws-waf-sandbox"
        }
      + tags_all                    = {
          + "agency"       = "dbhds"
          + "environment"  = "dev"
          + "owner"        = "Sydon"
          + "project-name" = "aws-waf-sandbox"
        }

      + default_action {
          + allow {
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "entts-metric"
          + sampled_requests_enabled   = true
        }
    }

  # aws_wafv2_web_acl_logging_configuration.waf_logging will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "waf_logging" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + region                  = "us-east-1"
      + resource_arn            = (known after apply)

      + redacted_fields {
          + single_header {
              + name = "user-agent"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rendered_rules_json = jsonencode([])

```
</details>

_Artifacts_: **plan.tfplan**, **plan.txt**, **plan.log** uploaded in this run.
